{
  "prospects": [
    {
      "companyName": "HeliosAgTech",
      "industry": "Autonomous Agriculture Robotics",
      "headquarters": "Fresno, CA",
      "annualRevenue": "62M",
      "growthStage": "Series C",
      "techStack": {
        "cloud": "AWS (EKS, IoT Core, Greengrass)",
        "data": "Snowflake, dbt, Kafka",
        "app": "Node.js, Python, ROS2",
        "security": "Wiz, Panther"
      },
      "challenges": [
        "Edge device fleet needs zero-touch provisioning across remote farms",
        "Seasonal data spikes overwhelm current data pipelines",
        "Compliance pressure for SOC 2 and FDA food-safety telemetry"
      ],
      "buyingTriggers": [
        "Expanded into Latin America with new field robotics teams",
        "Board mandate to standardize observability and cost governance",
        "Upcoming Series D diligence requires cloud maturity proof points"
      ],
      "competitiveNotes": [
        "Talking to HashiCorp services partner for IaC advisory",
        "Evaluating Deloitte’s AgTech practice for managed services",
        "Prior negative experience with boutique MSP lacking robotics expertise"
      ],
      "personas": [
        {
          "name": "Mara Singh",
          "title": "VP Cloud & Edge Engineering",
          "personaBio": "Ex-Tesla Autonomy lead specializing in orchestration for mixed edge-cloud workloads; obsessed with predictable OTA updates and SLA transparency."
        },
        {
          "name": "Luis Ortega",
          "title": "Director of Data Reliability",
          "personaBio": "Owns sensor-to-snowflake pipeline; cares about data quality SLAs, rapid root-cause analysis, and cost controls for bursty ingestion."
        }
      ]
    },
    {
      "companyName": "NovaThera Labs",
      "industry": "Personalized Biologics Manufacturing",
      "headquarters": "Cambridge, MA",
      "annualRevenue": "185M",
      "growthStage": "Pre-IPO",
      "techStack": {
        "cloud": "Azure (AKS, Synapse, Purview)",
        "data": "Databricks, Lakehouse Federation, Azure ML",
        "app": ".NET 8 microservices, Go control plane",
        "security": "CrowdStrike, Azure Defender, Immuta"
      },
      "challenges": [
        "Batch manufacturing twins lack unified governance across GMP/GxP zones",
        "Need faster ML deployment cycles for real-time therapy personalization",
        "Complex vendor ecosystem causing duplicated compliance evidence"
      ],
      "buyingTriggers": [
        "FDA audit window in 6 months requires validated cloud change controls",
        "Spin-out of EU subsidiary driving need for multi-region blueprint",
        "CFO wants predictable FinOps model before S-1 filing"
      ],
      "competitiveNotes": [
        "Accenture Life Sciences courting for multi-year transformation",
        "Internal team piloting AWS as shadow IT; leadership wants neutral advisor",
        "Worked with Slalom previously but lacked depth in regulated manufacturing"
      ],
      "personas": [
        {
          "name": "Dr. Evelyn Park",
          "title": "Chief Digital Manufacturing Officer",
          "personaBio": "Leads continuous manufacturing digitization; expects partners to understand GMP validation packs and hybrid cloud constraints."
        },
        {
          "name": "Marcus Feld",
          "title": "Head of Cloud Platform",
          "personaBio": "Former hedge-fund infra lead; focused on policy-as-code, GitOps, and reducing time-to-approve for high-risk changes."
        }
      ]
    },
    {
      "companyName": "AetherGrid Mobility",
      "industry": "Urban eVTOL Mobility Networks",
      "headquarters": "Austin, TX",
      "annualRevenue": "44M",
      "growthStage": "Series B",
      "techStack": {
        "cloud": "GCP (GKE, Cloud Run, Pub/Sub)",
        "data": "BigQuery, Vertex AI, TimescaleDB",
        "app": "Rust flight systems, React Native passenger app",
        "security": "Drata, Lacework, Cloudflare Zero Trust"
      },
      "challenges": [
        "Need deterministic latency between flight control systems and cloud analytics",
        "Safety certification demands tamper-proof telemetry lineage",
        "Partner ecosystem (airports, cities) requires multi-tenant isolation"
      ],
      "buyingTriggers": [
        "Signed MOU with Dubai Smart Mobility Council requiring 24/7 ops",
        "Recent incident triggered board request for external reliability audit",
        "Preparing for FAA Part 135 certification—needs documented runbooks"
      ],
      "competitiveNotes": [
        "In talks with Google PSO but budget constrained",
        "Rival eVTOL startup partnered with Thoughtworks causing executive pressure",
        "Internal SRE team stretched thin; open to managed reliability pods"
      ],
      "personas": [
        {
          "name": "Noah Reyes",
          "title": "CTO",
          "personaBio": "Aerospace software veteran; values partners who blend rigorous safety discipline with startup velocity."
        },
        {
          "name": "Sofia Almeida",
          "title": "Head of Reliability Engineering",
          "personaBio": "Runs 12-person SRE team; metric-driven, wants chaos engineering playbooks and real-time incident coaching."
        }
      ]
    }
  ]
}
